#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	//关系操作符 > >= < <= !=  == 判断是否相等
	//逻辑操作符（判断真假）：&&逻辑与(两个都为真，则为1)   ||逻辑或(只要一个为真，就为1)    0-假 非0-真
	// 	   区分逻辑与和按位与    1&2----->0       1&&2---->1
	//     区分逻辑或和按位或    1|2----->3      1||2---->1
	

	//逻辑与的特点：左边为假，右边就不用计算
	//逻辑或的特点：左边为真，右边就不用计算

	int i = 0, a = 0, b = 2, c = 3, d = 4;
	//int i = 0, a = 1, b = 2, c = 3, d = 4;
	//i = a++ && ++b && d++; 
	i = a++ || ++b || d++;

	 //printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);  // 1  2  3  4
	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);  //1  3  3  4
	

	return 0;
}